2016/brp 2016-02-09/test/testcases/legacy/src/main/resources/testcases/art_input_MutatieleveringOpDoelbinding/data/BRAL9027-TC0101-3-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670014</ABONNEMENT>
            <NAAM>Mutaties op personen van wie u de bijhoudingspartij heeft id 347</NAAM>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
  <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Mutaties op personen van wie u de bijhoudingspartij heeft id 347</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:meldingen>
    <brp:melding brp:objecttype="Melding" brp:referentieID="1">
      <brp:regelCode>BRLV0028</brp:regelCode>
      <brp:soortNaam>Waarschuwing</brp:soortNaam>
      <brp:melding>De geleverde persoon heeft de doelbindingspopulatie verlaten. Mutatielevering voor deze persoonslijst is gestopt.</brp:melding>
    </brp:melding>
  </brp:meldingen>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>05007</brp:code>
    <brp:naam>Verhuizing naar buitenland</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>185901</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="*">
        <brp:soortCode>*</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>

          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>1981-10-02T01:00:00.000+01:00</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1981-10-02</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>250015742</brp:burgerservicenummer>
          <brp:administratienummer>7946194108</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>*</brp:indicatieNamenreeks>
          <brp:voornamen>*</brp:voornamen>
          <brp:voorvoegsel>*</brp:voorvoegsel>
          <brp:scheidingsteken>-</brp:scheidingsteken>
          <brp:geslachtsnaamstam>*</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datum>*</brp:datum>
          <brp:gemeenteCode>*</brp:gemeenteCode>
          <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
          <brp:omschrijvingLocatie>*</brp:omschrijvingLocatie>
          <brp:landGebiedCode>*</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:code>*</brp:code>
        </brp:geslachtsaanduiding>
        <brp:bijhouding brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:datumEindeGeldigheid>*</brp:datumEindeGeldigheid>
          <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>*</brp:actieVerval>
          <brp:datumAanvangGeldigheid>*</brp:datumAanvangGeldigheid>
          <brp:partijCode>*</brp:partijCode>
          <brp:bijhoudingsaardCode>*</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>*</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>*</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:adressen>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Wijziging" brp:voorkomenSleutel="*" objectSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datumAanvangGeldigheid>2005-03-28</brp:datumAanvangGeldigheid>
            <brp:datumEindeGeldigheid>${vandaag(0,0,0)}</brp:datumEindeGeldigheid>
            <brp:actieAanpassingGeldigheid>*</brp:actieAanpassingGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>2005-03-28</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>0344</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>3</brp:huisnummer>
            <brp:postcode>3511BA</brp:postcode>
            <brp:woonplaatsnaam>Utrecht</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
          <brp:adres brp:objecttype="PersoonAdres" brp:verwerkingssoort="Verval" brp:voorkomenSleutel="*" objectSleutel="*">
            <brp:tijdstipRegistratie>2005-03-28T02:00:00.000+02:00</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:datumAanvangGeldigheid>2005-03-28</brp:datumAanvangGeldigheid>
            <brp:soortCode>W</brp:soortCode>
            <brp:redenWijzigingCode>P</brp:redenWijzigingCode>
            <brp:aangeverAdreshoudingCode>P</brp:aangeverAdreshoudingCode>
            <brp:datumAanvangAdreshouding>2005-03-28</brp:datumAanvangAdreshouding>
            <brp:gemeenteCode>0344</brp:gemeenteCode>
            <brp:naamOpenbareRuimte>Vredenburg</brp:naamOpenbareRuimte>
            <brp:afgekorteNaamOpenbareRuimte>Vredenburg</brp:afgekorteNaamOpenbareRuimte>
            <brp:huisnummer>3</brp:huisnummer>
            <brp:postcode>3511BA</brp:postcode>
            <brp:woonplaatsnaam>Utrecht</brp:woonplaatsnaam>
            <brp:landGebiedCode>6030</brp:landGebiedCode>
          </brp:adres>
        </brp:adressen>
        <brp:migratie brp:verwerkingssoort="Toevoeging" brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>${vandaag(0,0,0)}</brp:datumAanvangGeldigheid>
          <brp:soortCode>E</brp:soortCode>
          <brp:landGebiedCode>5010</brp:landGebiedCode>
          <brp:buitenlandsAdresRegel1>Dezeadresregelis35karakters12345678</brp:buitenlandsAdresRegel1>
          <brp:buitenlandsAdresRegel2>Buitenlandsadresregel2</brp:buitenlandsAdresRegel2>
          <brp:buitenlandsAdresRegel3>Buitenlandsadresregel3</brp:buitenlandsAdresRegel3>
          <brp:buitenlandsAdresRegel4>Buitenlandsadresregel4</brp:buitenlandsAdresRegel4>
          <brp:buitenlandsAdresRegel5>Buitenlandsadresregel5</brp:buitenlandsAdresRegel5>
          <brp:buitenlandsAdresRegel6>Buitenlandsadresregel6</brp:buitenlandsAdresRegel6>
        </brp:migratie>
        <brp:administratieveHandelingen>*</brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>